# Задание 1: Вывод четных чисел
# Напишите программу, которая использует цикл для вывода всех четных чисел от 1 до введенного пользователем числа включительно.

# def even_digit(digit):
#     for i in range(1, digit):
#         if i % 2 == 0:
#             print(i)


# user_digit = int(input("Укажите, до какого числа печатать чётные числа"))

# even_digit(user_digit +1)

# Задание 2: Подсчет количества цифр
# Напишите программу, которая запрашивает у пользователя целое число и подсчитывает количество цифр в этом числе.

# def digit_counter(num):
#     return len(num)

# user_number = input()

# print(digit_counter(user_number))

# Задание 3: Сумма чисел в строке
# Задача:
# Напишите программу, которая запрашивает у пользователя строку, содержащую числа, разделенные пробелом, и выводит сумму этих чисел.

# def calculate_sum(num):
#     return sum(num)

# user_number = list(map(int, input("Введите числа через пробел: ").split(" ")))
# # print(user_number)
# print(f"Сумма введенных чисел: {calculate_sum(user_number)}")
